DB_KVEST = {"Мемориальные доски на Октябрском - Сложный":
[{"🎓 В нашем городе есть гимназия, которая носит имя великого человека. 🎖 Он был не просто участником Великой Отечественной войны, но и директором этой самой гимназии! 🌟 И знаете что? В честь этого человека даже установлена мемориальная доска! 💥\n\nВы готовы узнать, где она находится? 🔎 Давайте разберемся вместе! 🧐💭": [61.793995, 34.370359, 3]},
{"🌟 Основатель офтальмологической помощи в Карелии, 💉 доктор медицины и Герой труда! 🏅 В его честь была установлена памятная доска! 🏆\n\nХотите узнать, где она расположена? 🤔 \nВместе раскроем все тайны! 👀": [61.796486, 34.372404, 3]},
{"Гаврила Романович Державин запустил одно удивительное учреждение! 😯 Знаете, что это такое и где установлена мемориальная доска в честь двухсотлетия его открытия? 🧐": [61.796459, 34.363813, 3]},
{"Первому директору школы 🏫 посвящена мемориальная доска 📜, которая установлена на здании школы. Хотите узнать, кому именно она посвящена и где находится? 🤔": [61.801210, 34.355006, 3]},
{"Она - настоящее 💛 сердце благотворительного фонда “Милосердие”! \n🌏 Знаете, о ком речь? И где установлена памятная табличка в её честь? 🤔": [61.803690, 34.327329, 3]}],

#====================================================================================================================================================================================================================================================

"Памятные места на Октябрском - Лёгкий":
[{"На страже порядка ночью и днем\nВерную службу отважно несёт.\nНас стережет в будни и выходной.\nОн твердо знает: нам нужен покой!\n\nО ком идёт речь?\nВ честь них установлен памятник.\nГде он находится?": [61.803057, 34.347639, 1 ]},
{"На границе он стоит,\nВраг не лезет к нам, дрожит.\nВ поле, иль на берегу,\nПреграждает путь врагу.\n\nО ком идёт речь?\nВ честь них установлен памятник. Где он находится?": [61.801971, 34.346148, 1]},

{"Двенадцать городов получили статус.\nОтличились на войне\nИ высечены теперь на камне.\n\nО чём идёт речь? \nГде находится место, в котором рассказывается об этих городах?": [61.800390, 34.344055, 1]},

{"Маршал Победы – званье его!\nСмело сражался с проклятым врагом!\nБил под Москвою врага и под Курском.\nБил богатырски, а, значит, по-русски!\n\nО ком идёт речь?\nВ честь него установлен памятник. \nГде он находится?": [61.799856, 34.343002, 1]},
{"Сейчас первое мая - день весны и труда. А что значил этот день в дореволюционной России для рабочих?\n\nЭтому событию посвящён памятник. \nГде он находится?": [61.796657, 34.336993, 1]}],

#====================================================================================================================================================================================================================================================

"Патриотический квест по микрорайону Древлянка - Лёгкий":[{"Памятник верному другу человека": [61.770871, 34.339893, 1]},
{"Место, откуда видно весь Петрозаводск (рядом)": [61.768815, 34.333588, 1]},
{"Арт-объект у главного центра спорта ": [61.764377, 34.348610, 1]},
{"Здесь сидит земноводное и можно выпить воды ": [61.765551, 34.288652, 1]}],

#====================================================================================================================================================================================================================================================

"Патриотический квест по микрорайону Перевалка - Лёгкий":
[{"Сквер имени человека, что пошёл по стопам рыжей скакуньи и стрелы": [61.784821, 34.346145, 1]},
{"Ужаснейший лагерь №6, оставивший неизгладимый отпечаток в памяти тех, кто выжил после него": [61.788107, 34.337918, 1]},
{"Памятная доска писателю-фантасту, а также основателю теории решения «интересных» задач ": [61.782087, 34.328020, 1]},
{"О ком маршал Жуков говорил подобными словами: «был прекрасным штабистом, который обладал завидной способностью коротко и ясно излагать свои мысли и к тому же имел на редкость красивый и чёткий почерк»? Дабы не было путаницы, загаданный объект находится дальше от перекрёстка с улицей Чапаева": [61.781136, 34.331219, 1]},
{"Герой военного времени с номером 738-47": [61.782504, 34.345573, 1]}],

#====================================================================================================================================================================================================================================================


"Патриотический квест по Центру - Сложный":
[{"Три десятка школ и больше сотни детсадов, тысячи домов и целая железная дорога — всё построено при нем и благодаря ему. Жесткий начальник, он сделал из Петрозаводска столичный город»": [61.788850, 34.366725, 3]},
{"Смел огонь, они смелее,\nОн силен, они сильнее,\nИх огнём не испугать,\nИм к огню не привыкать!": [61.789533, 34.368963, 3]},
{"Писатель, литературовед, заслуженный работник культуры Карельской АССР, член Союза писателей СССР, почётный гражданин города Петрозаводска В предвоенные годы он писал учебники и составлял хрестоматии для финских школ Карельской АССР и Ленинградской области, а также занимался переводами художественной литературы на финский язык и литературной критикой. В 1938 году был арестован, после 8 лет лагерей вернулся в Карелию. Работал в средней школе села Ведлозеро, а с 1961 года и до выхода на пенсию — редактором в финской редакции издательства «Прогресс» Петрозаводска.": [61.790905, 34.366458, 3]},
{"Был композитором Гимна Карело-Финской Советской Социалистической Республики и одним из основоположников профессионального музыкального искусства. В 1971 году Петрозаводскому музыкальному училищу присвоено его имя.": [61.792602, 34.369213, 3]},
{"«И нет ничего более трепетного, чем мать держащая своё дитя» ": [61.791228, 34.370274, 3]},
{"«Лучший отдых затаился рядом с бегемотом, но не в Африке, а в родной Карелии»": [61.791125, 34.391582, 3]}],

#====================================================================================================================================================================================================================================================

"Патриотический квест по Центру - Лёгкий":
[{"Этот мемориальный комплекс расположен в городе Петрозаводске в сквере Партизанская Поляна и он увековечил память всех воинских формирований Карельского фронта, принимавших участие в обороне и освобождении Карелии, а также имена 134 Героев Советского Союза и 15 полных кавалеров ордена Славы, удостоенных этого звания за отличия в сражениях в составе частей и соединений Карельского фронта.": [61.785398, 34.366562, 1]},
 {"Это что за Большевик лезет там на броневик?\nОн большую кепку носит, букву \"Рррр\" не произносит,\nОчень добрый и простой...\nДогадайтесь, кто такой?": [61.787652, 34.364544, 1]},
 {"Над могилой, в тихом парке\nРасцвели тюльпаны ярко.\nВечно тут огонь горит,\nТут солдат советский спит.\nМы склонились низко-низко\nУ подножья обелиска,\nНаш венок расцвёл на нём\nЖарким, пламенным огнём.\nМир солдаты защищали,\nЖизнь за нас они отдали.\nСохраним в сердцах своих\nПамять светлую о них!\nКак продолжение жизни солдат\nПод звёздами мирной державы\nЦветы на ратных могилах горят\nВенками немеркнущей славы.": [61.787111, 34.366519, 1]},
 {"Про кого написана эта часть биографии? Найдите доску.\n«Значительное влияние на его творчество оказала долгая поездка, предпринятая им по Карелии, что отражено в некоторых его произведениях. Тогда он был Олонецким губернатором, и в целях инспекции проехал на лошадях и лодках более 2000 километров по этому живописному краю.»": [61.787933, 34.367001, 1]},
 {"«Не муж и жена, а четыре разных человека»": [61.788362, 34.379424, 1]},
 {"«Русская народная сказительница, милая старушка из 19 века выступала в гимназии 6 марта 1896 года. Там о ней память по сей день и хранится»": [61.788036, 34.383465, 1]}]

}



# ============================================================================= В случае, если я этого не сделал (наверное было лень) оставлю помощь.
# =============================================================================     вы просто так не добавите новые фразы :)
# ============================================================================= нужно внести изменения в random_message_continue и random_message_end

mas_command_not_found = ["Ой, извините, но моя сенсорная панель сегодня утром решила взять выходной. \nПрости, что не смог распознать твое сообщение! 🤖🙇‍♂️",
                         "Бип-буп... Ошибка! Похоже, я все еще учусь читать мысли. Но я обещаю, что скоро разберусь, что ты написал! 🤔📖",
                         "Ooops! Кажется, мой режим \"Чтение мыслей\" сейчас отключен. Извини за путаницу! Но могу попробовать угадать, о чем ты говорил: 🤔🔮 Ты рассказывал шутку или раздавал комплименты? ",
                         "Прости, я прошу тебя представиться еще раз, чтобы мои алгоритмы поняли точно, что ты написал. С моей стороны была небольшая путаница! 🙊🔄",
                         "Ох, кажется, мой код немного запутался и находит тебя загадкой! Но благодаря твоему терпению, мы вместе ее разгадаем! 🧩💡",
                         "Woopsie-daisy! Похоже, я ошибочно решил, что ты написал на языке дварфов. Извини за путаницу, но я работаю над тем, чтобы понимать твой уникальный стиль общения! 🧝‍♀️📚",
                         "Ой-ой! Прости, но моя база данных путается, когда переходит к шуткам и играм слов. Я уверен, что ты написал что-то умное и забавное, и я всего лишь восстанавливаю недостающий кусочек! 😄🧩",
                         "Хмм, это какая-то секретная кодировка, которую я пока не расшифровал? Подожди немного, и я отправлю своих алгоритмов на курсы дешифровки! 🔎🤔",
                         "Видимо, ты используешь супер-секретный язык, который я пока не понимаю. Скоро я возьму уроки перевода, чтобы понять твои сообщения! 🧑‍🎓🌐",
                         "Ooops! Мой роботический мозг сделал сложное судоку из твоего сообщения. Но не переживай, я разгадаю головоломку и пойму, что ты написал. Мне просто нужно добавить кусочек! 🧩✍️"]


mas_quest_comleted = ["🎉 Поздравляю с успешным прохождением Квеста! \nТеперь вы можете добавить в своем резюме навык 'Профессиональный Квестолог'! ✨",
                      "🎉 Вы справились с Квестом так легко, что мы подозреваем, что у вас есть суперспособности! \nМожете ли вы, пожалуйста, делиться своим секретом? 🤫",
                      "🎉 Особенное признание тем, кто завершает Квест на одном дыхании и без перекуров! 💪",
                      "🎉 Поздравляем с победой в Квесте! Мы отменяем все репорты о потерянных носках, пока вы находитесь в окрестностях. 🧦🚫",
                    "🎉 Вы успешно прошли Квест, а теперь можете рассказывать всем истории о своей бесстрашии и чудесных навыках 'кликать мышкой'! 🐭💻",
                    "🎉 Вам удалось найти выход из квестовой петли! \nВы официально заявляетесь на звание 'Мастер Квестовых Петель'. 🔁🔓",
                    "🎉 Вам удалось разгадать все загадки в Квесте! Не поделитесь ли секретом, где можно получить Нобелевскую премию за гениальность? 🏆🧠",
                    "🎉 Вы завершили Квест, и теперь придется искать новое приключение. \n🚨Предупреждение🚨: последствия могут включать общение с реальными людьми и наконец-то приготовление обеда. 🌮🗣️",
                    " 🎉 Вы закончили Квест по нестандартному сценарию, и теперь мы должны предложить вам роль в Голливуде! 🎥🌟",
                    "🎉 Официально объявляем вас Королевой/Королем Квестов! \nОчень жаль, что корона у нас закончилась, но вы заслуживаете все почести и уважение! 👑💖"]

mas_quest_comleted_fifty_percentages = ["😭 Пропустить вопросы — это не конец, попробуйте снова и у вас получится! \nКвест пройден, но мы не сдаемся!",
                                     "⏰ Не забывайте следить за временем и не пропускать вопросы! \nЗадание выполнено, идём дальше!",
                                     "💡 Используйте знания и умения, чтобы ответить и достичь успеха! \nПуть пройден, новые горизонты впереди!",
                                     "💪🏻 Не сдаёмся и стараемся лучше! \nПрепятствие преодолено, впереди новые испытания!",
                                     "🌐 Не унываем, всегда есть шанс начать всё сначала! \nТочка поставлена, начинается новая глава!",
                                     "🥇 Не сдавайтесь, стремитесь к лучшему! \nЦель достигнута, ставим новые цели!",
                                     "🌈 Не бойтесь ошибок, учитесь на них! \nМост пройден, дальше интереснее!",
                                     "📚 Анализируем ошибки, становимся лучше! \nЭтап завершен, впереди новый!",
                                     "💪 Вершины покоряются, новые вершины ждут! \nВершина покорена, впереди новые вершины!",
                                     "💡 Не забываем анализировать ошибки! \nТуннель пройден, видим свет в конце!"]

mas_quest_comleted_twenty_five_percentages = ["Не идеально, но вполне неплохо! \n🎯 Квест завершен, продолжаем стремиться к большему 🚀 и никогда не сдаемся! 👊!",
                                     "Квест окончен, но есть над чем работать 🔧. \nНе останавливаемся на достигнутом и идем к новым высотам! 🌟",
                                     "Прошли квест, хоть и с пропусками 💨. \nТак держать! 👏, но всегда есть путь к совершенству, поэтому не забываем пробовать снова и снова! 🌟",
                                     "💪Квест завершен! Пусть не идеальный результат, но все равно достойный. \nСтремись к лучшему, и не сдавайся! 🍀💫🔃",
                                     "Квест закрыт! Результат не максимальный, но это не повод останавливаться. \nПродолжай идти вперед! 🏃‍♀️🏃‍♂️🔁",
                                     "Квест пройден, пусть и не на максимальное количество очков! \nПродолжай стараться и не бойся браться за новые испытания. 🎮🏅",
                                     "Этот квест окончен, но твой путь к успеху продолжается! \nНе стой на месте и попробуй свои силы в другом задании. 🏃‍♀️🎠",
                                     "Задание выполнено, хоть и есть к чему стремиться. Не бойся браться за новое и у тебя все получится! 🌠✨",
                                     "Этот квест завершен, но всегда можно пройти другой и добиться лучшего результата! 🕹️💪",
                                     "Квест закрыт, но есть куда расти! \nНе сдавайся, и пройди его снова, или попробуй другой! 🔄"]

mas_continue_question = ["Ах, оказывается, у вас пропанковское настроение - \"пропускай и несдавайся\"! Но не волнуйтесь, я уверен, что следующие вопросы станут вашими проверками на героизм! 💪✨",
                         "О, о, о! Бунтарь-пропускник пролетел мимо вопроса! Но поверьте мне, наш квест еще полон невероятных предприятий и загадок, так что держите нос спереди и идите вперед с непревзойденным энтузиазмом! 🕵️‍♂️🚀",
                         "Ой-ой-ой! Вы стали непослушным пропускником, словно изгой среди квестовых ребят! Но не беспокойтесь, вся эпичность и приключения только начинаются, и я знаю, что вы примете вызов жизни с чистой совестью! 👑🌟",
                         "Пропускники-ребята, у вас есть специальный билет на квестовое безумие! И хотя первый вопрос проскочил, давайте действовать, словно квестовые мастера, чтобы впечатлить всех со следующими ответами! 🎩🎒",
                         "Будто \"пропускник-вулканический энтузиаст\", вам удалось ускользнуть от вопроса! Но я знаю, в ваших венах течет квестовая страсть, и вы готовы сокрушить следующие вызовы с храбростью и улыбкой! ⚔️😄",
                         "Ух ты, пропускник с безудержным стремлением к особым моментам! Хотя вы упустили вопрос, это только начало интереснейших приключений, где вы сможете преодолеть загадки с невероятным задором и бесстрашием! 🌟💥",
                         "Ой-ой, премиум пропускник в действии! Вы не останавливаетесь на мельчайших деталях, но знайте, что каждый следующий вопрос - это ваш пасспорт к квестовым победам и веселью! 💼🔑",
                         "\"Пропускник из тайной логовища\" прошел сквозь вопрос, как рыцарь через пещеру! Впереди вас ждут волшебные мгновения и увлекательные загадки, чтобы вы сияли ярче всех звезд в квестовом небе! 🏰✨",
                         "Ой-ой, вы стали настоящим \"пропуквестничком\"! Вы сокрушили вопрос своими особыми способностями, но продолжайте идти вперед с уверенностью, что вас ждет квестовая слава и ошеломительное приключение! 🌟🚶‍♀️",
                         "Эй, пропускник-экстравагант! Вопрос скользнул мимо вас, но не позволяйте этому заставить вас сдаваться! Давайте продолжим этот квестовый танец и оставим следующие вопросы без промаха! 💃🎯"]


import telebot
from telebot import types
import pickle
import os.path

import logging
from logging.handlers import RotatingFileHandler

import random


bot = telebot.TeleBot('6535191442:AAEI6xYilhMj0iTaR4CzJJ9VWyL5woxghlU') # Основной



logger2 = logging.getLogger(__name__)
logger2.setLevel(logging.INFO)

# настройка обработчика и форматировщика для logger2
#handler2 = logging.FileHandler(f"{__name__}.log", mode='a')

handler2 = RotatingFileHandler(f"{__name__}.log", maxBytes=20480, backupCount=3, mode='a')

formatter2 = logging.Formatter("%(name)s %(asctime)s %(levelname)s %(message)s")



# добавление форматировщика к обработчику
handler2.setFormatter(formatter2)
# добавление обработчика к логгеру
logger2.addHandler(handler2)

logger2.info(f"Errors and logger information from the file {__name__}...")


mas=[]
for key in DB_KVEST:
    mas.append(key)

db_consumer = {}
db_message = {}

if os.path.exists('db_consumer.pickle'):
    with open('db_consumer.pickle', 'rb') as f:
        db_consumer = pickle.load(f)


@bot.message_handler(commands=['start'])
def start(message):
    userID = message.from_user.id
    if userID not in db_consumer:
        db_consumer[userID] = {"Menu": 0, "Stage": 0, "Point": 0, "Flag": 1, "Kvest": ""}

    if userID not in db_message:
            db_message[userID] = {"Skip": 0, "Random_continue": 0, "Random_end": 0}


    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    btn1 = types.KeyboardButton("Начать квест")
    markup.add(btn1)
    mess = f'Привет, {message.from_user.first_name}! Добро пожаловать на прохождение квестов.'
    bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)

    logger2.info(f"Creating a new user.")



@bot.message_handler(content_types=['text'])
def func(message):
    userID = message.from_user.id
#================================================================================================================
    if message.text == "Начать квест":
        try:
            markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
            button1 = types.KeyboardButton('<')
            button2 = types.KeyboardButton('⭐ Баллы ⭐')
            button3 = types.KeyboardButton('>')
            button4 = types.KeyboardButton(mas[0])
            markup.add(button1, button2, button3, button4)
            mess = f'Выберите квест'
            bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)

            logger2.info(f"Start completing the quest.")

        except Exception as e:
            db_consumer[userID] = {"Menu": 0, "Stage": 0, "Point": 0, "Flag": 1, "Kvest": ""}
            db_message[userID] = {"Skip": 0, "Random_continue": 0, "Random_end": 0}

            logger2.warning("The problem with creating databases")



    elif message.text == ">":
        try:
            bot.delete_message(message.chat.id, message.message_id)

            db_consumer[userID]['Menu'] += 1
            if(db_consumer[userID]['Menu'] >= len(mas)): db_consumer[userID]['Menu'] = 0

            markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
            button1 = types.KeyboardButton('<')
            button2 = types.KeyboardButton('⭐ Баллы ⭐')
            button3 = types.KeyboardButton('>')
            button4 = types.KeyboardButton(mas[db_consumer[userID]['Menu']])
            markup.add(button1, button2, button3, button4)
            mess = f'Вот ещё квесты для вас'
            bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)

            logger2.info(f"Choosing the next quest")

        except Exception as e:
            db_consumer[userID] = {"Menu": 0, "Stage": 0, "Point": 0, "Flag": 1, "Kvest": ""}
            db_message[userID] = {"Skip": 0, "Random_continue": 0, "Random_end": 0}

            logger2.warning("The problem with creating databases")


    elif message.text == "<":
        try:

            bot.delete_message(message.chat.id, message.message_id)

            db_consumer[userID]['Menu'] -= 1
            if (db_consumer[userID]['Menu'] < 0): db_consumer[userID]['Menu'] = len(mas) - 1

            markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
            button1 = types.KeyboardButton('<')
            button2 = types.KeyboardButton('⭐ Баллы ⭐')
            button3 = types.KeyboardButton('>')
            button4 = types.KeyboardButton(mas[db_consumer[userID]['Menu']])

            markup.add(button1, button2, button3, button4)
            mess = f'Вот ещё квесты для вас'
            bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)

            logger2.info(f"Choosing the previous quest")

        except Exception as e:
            db_consumer[userID] = {"Menu": 0, "Stage": 0, "Point": 0, "Flag": 1, "Kvest": ""}
            db_message[userID] = {"Skip": 0, "Random_continue": 0, "Random_end": 0}

            logger2.warning("The problem with creating databases")

#================================================================================================================
    elif message.text == "Пропустить вопрос":
        try:
            logger2.info(f"Skipping a question")

            db_consumer[userID]["Stage"] += 1
            db_message[userID]["Skip"] += 1 # Смотрим, кто любит пропускать вопросики


            random_message_continue = random.randint(0, 9)

            #============================================ Обработка рандома, чтобы не попадался подряд (как минимум 1 раз) ============================================
            if(random_message_continue == db_message[userID]["Random_continue"]):
                random_message_continue += 1
                if(random_message_continue > 9):
                    random_message_continue = 0
                db_message[userID]["Random_continue"] = random_message_continue
            # ============================================ Обработка рандома, чтобы не попадался подряд (как минимум 1 раз) ============================================

            bot.send_message(message.chat.id, mas_continue_question[random_message_continue])


            if (db_consumer[userID]["Stage"] < len(DB_KVEST[db_consumer[userID]["Kvest"]])):
                logger2.info(f"Next question")

                mess = DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys()
                bot.send_message(message.chat.id, mess, parse_mode='html')
            else:
                logger2.info(f"Completing the quest in the missing riddles")

                random_message_end = random.randint(0, 9)

                # ============================================ Обработка рандома, чтобы не попадался подряд (как минимум 1 раз) ============================================
                if (random_message_end == db_message[userID]["Random_end"]):
                    random_message_end += 1
                    if (random_message_end > 9):
                        random_message_end = 0
                    db_message[userID]["Random_end"] = random_message_end
                # ============================================ Обработка рандома, чтобы не попадался подряд (как минимум 1 раз) ============================================

                if(db_message[userID]["Skip"] > round(db_consumer[userID]["Stage"] / 2)):  # Если пропущено больше 50% квеста
                    bot.send_message(message.chat.id, mas_quest_comleted_fifty_percentages[random_message_end])
                elif(db_message[userID]["Skip"] > round(db_consumer[userID]["Stage"] / 4)): # Если пропущено больше 25% квеста
                    bot.send_message(message.chat.id, mas_quest_comleted_twenty_five_percentages[random_message_end])
                else:                                                                         # Если квест пройден на 100%
                    bot.send_message(message.chat.id, mas_quest_comleted[random_message_end])

                db_consumer[userID]["Stage"] = 0
                db_message[userID]["Skip"] = 0

                markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
                button1 = types.KeyboardButton('<')
                button2 = types.KeyboardButton('⭐ Баллы ⭐')
                button3 = types.KeyboardButton('>')
                button4 = types.KeyboardButton(mas[0])

                markup.add(button1, button2, button3, button4)
                mess = f'Выберите квест'
                bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)
#==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==
                with open('db_consumer.pickle', 'wb') as f:
                    pickle.dump(db_consumer, f)

        except Exception as e:
            db_consumer[userID] = {"Menu": 0, "Stage": 0, "Point": 0, "Flag": 1, "Kvest": ""}
            db_message[userID] = {"Skip": 0, "Random_continue": 0, "Random_end": 0}

            logger2.warning("The problem with creating databases")
            logger2.exception("Error in congratulating the user for missing riddles")


    elif message.text == "⭐ Баллы ⭐":
        try:
            logger2.info(f"The output of information on the user's points")

            if db_consumer[userID]["Point"] % 10 == 1 and db_consumer[userID]["Point"] != 11:
                bot.send_message(message.chat.id, "У вас на данный момент есть *" + str(db_consumer[userID]["Point"]) + "* балл", parse_mode= "Markdown")
            elif db_consumer[userID]["Point"] % 10 >= 2 and db_consumer[userID]["Point"] % 10 <= 4 and db_consumer[userID]["Point"] != 12 and db_consumer[userID]["Point"] != 12 and db_consumer[userID]["Point"] != 14:
                bot.send_message(message.chat.id, "У вас на данный момент есть *" + str(db_consumer[userID]["Point"]) + "* балла", parse_mode= "Markdown")
            else:
                bot.send_message(message.chat.id, "У вас на данный момент есть *" + str(db_consumer[userID]["Point"]) + "* баллов", parse_mode= "Markdown")

            if(db_consumer[userID]["Point"] < 20):
                bot.send_message(message.chat.id, "С таками баллами тебя можно называть *Путешественник на лодочке*, продолжай поднимать баллы и твоё звание будет меняться!", parse_mode="Markdown")
            elif(db_consumer[userID]["Point"] < 50):
                bot.send_message(message.chat.id, "Ого, уже круто! Теперь ты признанный *Мастер курьерских голубей*, продолжай исследовать!", parse_mode="Markdown")
            else:
                bot.send_message(message.chat.id, "О тебе ходят слухи по городу, ведь теперь ты *Легенда городских квестов*!", parse_mode="Markdown")

        except Exception as e:
            db_consumer[userID] = {"Menu": 0, "Stage": 0, "Point": 0, "Flag": 1, "Kvest": ""}
            db_message[userID] = {"Skip": 0, "Random_continue": 0, "Random_end": 0}
            logger2.warning("The problem with creating databases")

# ================================================================================================================
    else:
        for i in range(len(mas)):
            if(message.text == mas[i]):
                db_consumer[userID]["Flag"] = 0

                markup = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True)
                button1 = telebot.types.KeyboardButton(text="Отправить местоположение", request_location=True)
                button2 = types.KeyboardButton('Пропустить вопрос')
                markup.add(button1, button2)


                db_consumer[userID]["Kvest"] = message.text
                mess = DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys()
                bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)

        if(db_consumer[userID]["Flag"] == 1):
            bot.send_message(message.chat.id, mas_command_not_found[random.randint(0, 9)])
        else:
            db_consumer[userID]["Flag"] = 1




#===================================================================================

@bot.message_handler(content_types=['location'])
def handle_location(message):
    userID = message.from_user.id
    latitude = message.location.latitude
    longitude = message.location.longitude

    if(abs(latitude - DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]][list(DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys())[0]][0]) < 0.0003 and
      abs(longitude - DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]][list(DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys())[0]][1]) < 0.0003):
        logger2.info(f"The location coincided with the place")

        db_consumer[userID]["Point"] += DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]][
            list(DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys())[0]][2]
        db_consumer[userID]["Stage"] += 1

        try:
            if (db_consumer[userID]["Stage"] < len(DB_KVEST[db_consumer[userID]["Kvest"]])):
                logger2.info(f"Next question")

                mess = DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys()
                bot.send_message(message.chat.id, mess, parse_mode='html')
            else:
                logger2.info(f"Completing the quest at the right point")

                random_message_end = random.randint(0, 9)

                # ============================================ Обработка рандома, чтобы не попадался подряд (как минимум 1 раз) ============================================
                if (random_message_end == db_message[userID]["Random_end"]):
                    random_message_end += 1
                    if (random_message_end > 9):
                        random_message_end = 0
                    db_message[userID]["Random_end"] = random_message_end
                # ============================================ Обработка рандома, чтобы не попадался подряд (как минимум 1 раз) ============================================

                if (db_message[userID]["Skip"] > round(
                        db_consumer[userID]["Stage"] / 2)):  # Если пропущено больше 50% квеста
                    bot.send_message(message.chat.id, mas_quest_comleted_fifty_percentages[random_message_end])
                elif (db_message[userID]["Skip"] > round(
                        db_consumer[userID]["Stage"] / 4)):  # Если пропущено больше 25% квеста
                    bot.send_message(message.chat.id, mas_quest_comleted_twenty_five_percentages[random_message_end])
                else:  # Если квест пройден на 100%
                    bot.send_message(message.chat.id, mas_quest_comleted[random_message_end])

                db_consumer[userID]["Stage"] = 0
                db_message[userID]["Skip"] = 0

                markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
                button1 = types.KeyboardButton('<')
                button2 = types.KeyboardButton('⭐ Баллы ⭐')
                button3 = types.KeyboardButton('>')
                button4 = types.KeyboardButton(mas[0])

                markup.add(button1, button2, button3, button4)
                mess = f'Выберите квест'
                bot.send_message(message.chat.id, mess, parse_mode='html', reply_markup=markup)
                # ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==  ==
                with open('db_consumer.pickle', 'wb') as f:
                    pickle.dump(db_consumer, f)
        except Exception as e:
            logger2.exception("Mistakes in congratulations without skipping a question")


    elif(abs(latitude - DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]][list(DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys())[0]][0]) < 0.003 and
        abs(longitude - DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]][list(DB_KVEST[db_consumer[userID]["Kvest"]][db_consumer[userID]["Stage"]].keys())[0]][1]) < 0.003):
        logger2.info(f"The user's location is close to the desired point")

        bot.send_message(message.chat.id, "️Вы где-то недалеко!🕵️‍♂️")
    else:
        logger2.info(f"The user's location is far from the specified point")

        bot.send_message(message.chat.id, "Вы где-то не там!⚠️")

bot.polling(none_stop=True)
